Sempre que temos dois DataFrames diferentes e queremos combiná-los em um, temos que dizer ao Pandas duas coisas principais:

   -  Qual é a coluna que você deseja mesclar? Em termos mais simples, quais valores ele deve tentar corresponder ao fazer uma fusão.
   -  Se houver um valor em um DataFrame, mas não no outro, como você deseja mesclar? Você quer mantê-lo, largue-o?

Em termos técnicos, isso significa que precisamos dizer ao Pandas qual chave de junção fazer a fusão e como fazer a fusão. Vamos dar uma olhada em nosso caso a seguir. Temos dois dataframes que desejamos fundir.

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

#### 1. Combine os dois dataframes utilizando `pd.merge()`

In [ ]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

#### 2. Crie três dataframes com os dicionários acima

#### 3. Junte os dois primeiros dataframes ao longo das linhas e atribua

#### 4. Junte os dois dataframes ao longo das colunas e atribua a todas as colunas de dados

#### 5. Dê um `merge` nestes dois últimos dataframes ao longo da variável `subject_id`

#### 6. Mescle apenas os dados que têm o mesmo `subject_id` em data1 e data2